from rsa.rsa import RSA

if __name__ == '__main__':
    p = 882493304303057
    q = 565640080106113
    e = 435510454193522616856570224823
    X1 = 33938304564942541056706890572
    Y2 = 167669363821217143128176537107

    rsa = RSA(p, q, e)
    print(f'Исходное сообщение X1: {X1}')
    Y1 = rsa.encrypt(X1)
    print(f'Зашифрованное сообщение Y1: {Y1}')
    X1_dec = rsa.decrypt(Y1)
    print(f'После расшифровки: {X1_dec}')

    print(f'Зашифрованное сообщение Y2: {Y2}')
    X2_dec = rsa.decrypt(Y2)
    print(f'После расшифровки: {X2_dec}')